# GetDocument Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryInstance..::..GetDocument Method
GeometryInstance Class See Also
---
Gets the document that contains the symbol of this instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public Document GetDocument()
```

Visual Basic
---
```text
Public Function GetDocument As Document
```

Visual C++
---
```text
public:
Document^ GetDocument()
```

# ### Return Value
Returns the document that contains the symbol of this instance.
# See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace